###############################
#  Taps                       #
###############################

# none!

###############################
#  Binaries                   #
###############################

brew "coreutils"
brew "mas" # https://github.com/mas-cli/mas 

###############################
#  macOS Apps via Cask        #
###############################

# cask list: https://formulae.brew.sh/cask/

cask_args appdir: "/Applications"

cask "discord" unless system("test -e /Applications/Discord.app")
cask "sourcetree" unless system("test -e /Applications/Sourcetree.app")
cask "sublime-text" unless system("test -e \"/Applications/Sublime Text.app\"")
cask "cyberduck" unless system("test -e /Applications/Cyberduck.app")
cask "mountain-duck" unless system("test -e \"/Applications/Mountain Duck.app\"")
cask "visual-studio-code" unless system("test -e \"/Applications/Visual Studio Code.app\"")
cask "spotify" unless system("test -e /Applications/Spotify.app")
cask "appcleaner" unless system("test -e /Applications/AppCleaner.app")

# download these directly from source
#cask "dropbox"
#cask "1password" 
#cask "firefox"

###############################
#  macOS Apps via App Store   #
###############################

# to see existing macOS apps, run $ mast list

# Apple
mas "Xcode", id: 497799835

# Third Party
mas "Day One", id: 1055511498
mas "Slack", id: 803453959
mas "Magnet", id: 441258766
mas "Things", id: 904280696