###############################
#  Taps                       #
###############################

tap "homebrew/homebrew-cask"
tap "homebrew/cask-versions"

###############################
#  Binaries                   #
###############################

brew "mas"
brew "wget"
brew "coreutils"

###############################
#  macOS Apps via Cask        #
###############################

# cask list: https://formulae.brew.sh/cask/

cask_args appdir: "/Applications"

cask "discord"
cask "sourcetree"
cask "sublime-text"
cask "cyberduck"
cask "mountain-duck"
cask "visual-studio-code"
cask "spotify"
cask "appcleaner"

# download these directly from source
#cask "dropbox"
#cask "1password" 
#cask "firefox"

###############################
#  macOS Apps via App Store   #
###############################

# to see existing macOS apps, run $ mast list

# Apple
mas "Xcode", id: 497799835

# Third Party
mas "Day One", id: 1055511498
mas "Slack", id: 803453959
mas "Magnet", id: 441258766
mas "Things", id: 904280696